fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродолжительностьОтпуска</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере 

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    ТаблицаДанных = ПолучитьИзВременногоХранилища(Параметры.Адрес); 
	ЗаполнитьДиаграмму(ТаблицаДанных);
	
КонецПроцедуры

#КонецОбласти
 
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграмму(ТаблицаДанных)
	
	Диаграмма.Очистить(); 
	
	СерияОтпуска = Диаграмма.Серии.Добавить();
	СерияОтпуска.Текст = "Отпуск";
	СерияОтпуска.Цвет = WebЦвета.Бирюзовый;
	
	СерияДлительногоОтпуска = Диаграмма.Серии.Добавить();
	СерияДлительногоОтпуска.Текст = "Отпуск с продолжительностью более 28 дней";
	СерияДлительногоОтпуска.Цвет = WebЦвета.Коралловый;
	
	Для Каждого Строка из ТаблицаДанных Цикл
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Точка.Текст = Строка.Сотрудник;
		
		Если Строка.ПродолжительностьОтпуска > 28 Тогда 
			Серия = СерияДлительногоОтпуска;
		Иначе
			Серия = СерияОтпуска;
		КонецЕсли; 
		
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;		
	КонецЦикла;	
	
КонецПроцедуры 

#КонецОбласти
